{"config": [{"config": {"kernel_constraint": null, "bias_regularizer": null, "trainable": true, "activation": "relu", "use_bias": true, "bias_constraint": null, "padding": "valid", "name": "conv2d_1", "dtype": "float32", "activity_regularizer": null, "filters": 32, "kernel_size": [3, 3], "data_format": "channels_last", "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "batch_input_shape": [null, 32, 32, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_1", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"bias_regularizer": null, "trainable": true, "activation": "relu", "use_bias": true, "bias_constraint": null, "padding": "valid", "name": "conv2d_2", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 32, "kernel_size": [3, 3], "data_format": "channels_last", "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_2", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"bias_regularizer": null, "trainable": true, "activation": "relu", "use_bias": true, "bias_constraint": null, "padding": "valid", "name": "conv2d_3", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 32, "kernel_size": [3, 3], "data_format": "channels_last", "strides": [1, 1], "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_3", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"kernel_regularizer": null, "trainable": true, "activation": "relu", "use_bias": true, "bias_constraint": null, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 128, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "trainable": true, "seed": null, "rate": 0.0, "noise_shape": 2}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "trainable": true, "activation": "relu", "use_bias": true, "bias_constraint": null, "name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 256, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "trainable": true, "seed": null, "rate": 0.0, "noise_shape": 2}, "class_name": "Dropout"}, {"config": {"kernel_regularizer": null, "trainable": true, "activation": "relu", "use_bias": true, "bias_constraint": null, "name": "dense_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 128, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "trainable": true, "activation": "sigmoid", "use_bias": true, "bias_constraint": null, "name": "dense_4", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 43, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "keras_version": "2.1.6", "backend": "tensorflow", "class_name": "Sequential"}