{"config": [{"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "relu", "dilation_rate": [1, 1], "data_format": "channels_last", "bias_constraint": null, "padding": "valid", "dtype": "float32", "bias_regularizer": null, "batch_input_shape": [null, 32, 32, 3], "kernel_size": [3, 3], "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "filters": 32, "name": "conv2d_1", "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "relu", "dilation_rate": [1, 1], "data_format": "channels_last", "bias_constraint": null, "padding": "valid", "bias_regularizer": null, "kernel_size": [3, 3], "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "filters": 6, "name": "conv2d_2", "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "padding": "valid", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "relu", "dilation_rate": [1, 1], "data_format": "channels_last", "bias_constraint": null, "padding": "valid", "bias_regularizer": null, "kernel_size": [3, 3], "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "filters": 16, "name": "conv2d_3", "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "padding": "valid", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "units": 120, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "bias_regularizer": null, "activation": "relu", "activity_regularizer": null, "use_bias": true, "trainable": true, "name": "dense_1", "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "rate": 0.0, "name": "dropout_1", "noise_shape": 2, "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "units": 84, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "bias_regularizer": null, "activation": "relu", "activity_regularizer": null, "use_bias": true, "trainable": true, "name": "dense_2", "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "rate": 0.0, "name": "dropout_2", "noise_shape": 2, "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "units": 42, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "bias_regularizer": null, "activation": "relu", "activity_regularizer": null, "use_bias": true, "trainable": true, "name": "dense_3", "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "units": 43, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "bias_regularizer": null, "activation": "sigmoid", "activity_regularizer": null, "use_bias": true, "trainable": true, "name": "dense_4", "kernel_regularizer": null}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.6"}