{"class_name": "Sequential", "keras_version": "2.1.6", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"batch_input_shape": [null, 32, 32, 3], "kernel_regularizer": null, "activation": "relu", "trainable": true, "use_bias": true, "activity_regularizer": null, "strides": [1, 1], "name": "conv2d_1", "kernel_constraint": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [3, 3], "padding": "valid", "bias_constraint": null, "dtype": "float32", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "activation": "relu", "trainable": true, "use_bias": true, "activity_regularizer": null, "strides": [1, 1], "name": "conv2d_2", "kernel_constraint": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [3, 3], "padding": "valid", "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "activation": "relu", "trainable": true, "use_bias": true, "activity_regularizer": null, "strides": [1, 1], "name": "conv2d_3", "kernel_constraint": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [3, 3], "padding": "valid", "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "trainable": true, "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "units": 128, "activation": "relu", "trainable": true, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_constraint": null, "bias_regularizer": null, "name": "dense_1", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"rate": 0.0, "name": "dropout_1", "seed": null, "trainable": true, "noise_shape": 2}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "units": 256, "activation": "relu", "trainable": true, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_constraint": null, "bias_regularizer": null, "name": "dense_2", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"rate": 0.0, "name": "dropout_2", "seed": null, "trainable": true, "noise_shape": 2}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "units": 128, "activation": "relu", "trainable": true, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_constraint": null, "bias_regularizer": null, "name": "dense_3", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "units": 43, "activation": "sigmoid", "trainable": true, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_constraint": null, "bias_regularizer": null, "name": "dense_4", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}]}