{"config": [{"config": {"trainable": true, "batch_input_shape": [null, 32, 32, 3], "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "strides": [1, 1], "padding": "valid", "kernel_size": [3, 3], "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "name": "conv2d_1", "kernel_constraint": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 32, "activation": "relu", "dtype": "float32", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "kernel_size": [3, 3], "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "strides": [1, 1], "padding": "valid", "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "name": "conv2d_2", "kernel_constraint": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 6, "activation": "relu", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1", "strides": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "kernel_size": [3, 3], "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "strides": [1, 1], "padding": "valid", "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "name": "conv2d_3", "kernel_constraint": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 16, "activation": "relu", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_2", "strides": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "units": 120, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "activation": "relu", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.0, "noise_shape": 2, "seed": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "units": 84, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2", "activation": "relu", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.0, "noise_shape": 2, "seed": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "units": 42, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_3", "activation": "relu", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "units": 43, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_4", "activation": "sigmoid", "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.6"}